; domain
(define (domain zeno-travel)
(:requirements :typing :strips)
(:types transportable city flevel - object
        aircraft person - transportable)

(:predicates (at ?x - transportable ?c - city)
             (in ?a - aircraft ?p - person)
	     (fuel-level ?a - aircraft ?l - flevel)
	     (next ?l1 - flevel ?l2 - flevel))


(:action board
 :parameters (?a - person ?b - aircraft ?c - city)

 :precondition (and (at ?a ?c)
                 (at ?b ?c))
 :effect (and (not (at ?a ?c))
              (in ?a ?b)))

(:action debark
 :parameters (?a - person ?b - aircraft ?c - city)

 :precondition (and (in ?a ?b)
                 (at ?b ?c))
 :effect (and (not (in ?a ?b))
              (at ?a ?c)))

(:action fly
 :parameters (?a - aircraft ?b - city ?c - city ?d - flevel ?e - flevel)

 :precondition (and (at ?a ?b)
                 (fuel-level ?a ?d)
		 (next ?e ?d))
 :effect (and (not (at ?a ?b))
              (at ?a ?c)
              (not (fuel-level ?a ?d))
              (fuel-level ?a ?e)))

(:action zoom
 :parameters (?a - aircraft ?b - city ?c - city ?d - flevel ?e - flevel ?f - flevel)

 :precondition (and (at ?a ?b)
                 (fuel-level ?a ?d)
		 (next ?e ?d)
		 (next ?f ?e)
		)
 :effect (and (not (at ?a ?b))
              (at ?a ?c)
              (not (fuel-level ?a ?d))
              (fuel-level ?a ?f)
	)
)

(:action refuel
 :parameters (?a - aircraft ?b - city ?c - flevel ?d - flevel)

 :precondition (and (fuel-level ?a ?c)
                 (next ?c ?d)
                 (at ?a ?b))
 :effect (and (fuel-level ?a ?d) (not (fuel-level ?a ?c))))


)

; problem
(define (problem ZTRAVEL-6-19)
(:domain zeno-travel)
(:objects
	plane1 - aircraft
	plane2 - aircraft
	plane3 - aircraft
	plane4 - aircraft
	plane5 - aircraft
	plane6 - aircraft
	person1 - person
	person2 - person
	person3 - person
	person4 - person
	person5 - person
	person6 - person
	person7 - person
	person8 - person
	person9 - person
	person10 - person
	person11 - person
	person12 - person
	person13 - person
	person14 - person
	person15 - person
	person16 - person
	person17 - person
	person18 - person
	person19 - person
	city0 - city
	city1 - city
	city2 - city
	city3 - city
	city4 - city
	city5 - city
	city6 - city
	city7 - city
	city8 - city
	city9 - city
	city10 - city
	city11 - city
	city12 - city
	city13 - city
	city14 - city
	city15 - city
	city16 - city
	city17 - city
	city18 - city
	city19 - city
	city20 - city
	fl0 - flevel
	fl1 - flevel
	fl2 - flevel
	fl3 - flevel
	fl4 - flevel
	fl5 - flevel
	fl6 - flevel
	)
(:init
	(at plane1 city12)
	(fuel-level plane1 fl3)
	(at plane2 city1)
	(fuel-level plane2 fl6)
	(at plane3 city15)
	(fuel-level plane3 fl0)
	(at plane4 city0)
	(fuel-level plane4 fl5)
	(at plane5 city16)
	(fuel-level plane5 fl3)
	(at plane6 city2)
	(fuel-level plane6 fl5)
	(at person1 city0)
	(at person2 city8)
	(at person3 city18)
	(at person4 city13)
	(at person5 city0)
	(at person6 city10)
	(at person7 city13)
	(at person8 city18)
	(at person9 city17)
	(at person10 city2)
	(at person11 city1)
	(at person12 city11)
	(at person13 city0)
	(at person14 city10)
	(at person15 city17)
	(at person16 city6)
	(at person17 city3)
	(at person18 city2)
	(at person19 city0)
	(next fl0 fl1)
	(next fl1 fl2)
	(next fl2 fl3)
	(next fl3 fl4)
	(next fl4 fl5)
	(next fl5 fl6)
)
(:goal (and
	(at plane3 city0)
	(at plane4 city14)
	(at plane6 city5)
	(at person1 city0)
	(at person2 city20)
	(at person3 city20)
	(at person4 city14)
	(at person5 city4)
	(at person6 city16)
	(at person7 city7)
	(at person8 city11)
	(at person9 city8)
	(at person10 city5)
	(at person11 city6)
	(at person12 city14)
	(at person13 city11)
	(at person14 city3)
	(at person15 city4)
	(at person16 city14)
	(at person17 city7)
	(at person18 city5)
	(at person19 city2)
	))

)

; plan
1. (board person18 plane6 city2)
   deleted: (at person18 city2)
   added: (in person18 plane6)
   goals met: 1 of 22
2. (zoom plane6 city2 city10 fl5 fl4 fl3)
   deleted: (at plane6 city2) (fuel-level plane6 fl5)
   added: (at plane6 city10) (fuel-level plane6 fl3)
   goals met: 1 of 22
3. (board person6 plane6 city10)
   deleted: (at person6 city10)
   added: (in person6 plane6)
   goals met: 1 of 22
4. (zoom plane6 city10 city13 fl3 fl2 fl1)
   deleted: (at plane6 city10) (fuel-level plane6 fl3)
   added: (at plane6 city13) (fuel-level plane6 fl1)
   goals met: 1 of 22
5. (board person7 plane6 city13)
   deleted: (at person7 city13)
   added: (in person7 plane6)
   goals met: 1 of 22
6. (board person4 plane6 city13)
   deleted: (at person4 city13)
   added: (in person4 plane6)
   goals met: 1 of 22
7. (board person5 plane4 city0)
   deleted: (at person5 city0)
   added: (in person5 plane4)
   goals met: 1 of 22
8. (board person19 plane4 city0)
   deleted: (at person19 city0)
   added: (in person19 plane4)
   goals met: 1 of 22
9. (zoom plane4 city0 city2 fl5 fl4 fl3)
   deleted: (at plane4 city0) (fuel-level plane4 fl5)
   added: (at plane4 city2) (fuel-level plane4 fl3)
   goals met: 1 of 22
10. (debark person19 plane4 city2)
   deleted: (in person19 plane4)
   added: (at person19 city2)
   goals met: 2 of 22
11. (board person10 plane4 city2)
   deleted: (at person10 city2)
   added: (in person10 plane4)
   goals met: 2 of 22
12. (zoom plane4 city2 city14 fl3 fl2 fl1)
   deleted: (at plane4 city2) (fuel-level plane4 fl3)
   added: (at plane4 city14) (fuel-level plane4 fl1)
   goals met: 3 of 22
13. (refuel plane3 city15 fl0 fl1)
   deleted: (fuel-level plane3 fl0)
   added: (fuel-level plane3 fl1)
   goals met: 3 of 22
14. (fly plane3 city15 city0 fl1 fl0)
   deleted: (at plane3 city15) (fuel-level plane3 fl1)
   added: (at plane3 city0) (fuel-level plane3 fl0)
   goals met: 4 of 22
15. (board person13 plane3 city0)
   deleted: (at person13 city0)
   added: (in person13 plane3)
   goals met: 4 of 22
16. (refuel plane3 city0 fl0 fl1)
   deleted: (fuel-level plane3 fl0)
   added: (fuel-level plane3 fl1)
   goals met: 4 of 22
17. (board person11 plane2 city1)
   deleted: (at person11 city1)
   added: (in person11 plane2)
   goals met: 4 of 22
18. (zoom plane2 city1 city6 fl6 fl5 fl4)
   deleted: (at plane2 city1) (fuel-level plane2 fl6)
   added: (at plane2 city6) (fuel-level plane2 fl4)
   goals met: 4 of 22
19. (board person16 plane2 city6)
   deleted: (at person16 city6)
   added: (in person16 plane2)
   goals met: 4 of 22
20. (debark person11 plane2 city6)
   deleted: (in person11 plane2)
   added: (at person11 city6)
   goals met: 5 of 22
21. (zoom plane2 city6 city14 fl4 fl3 fl2)
   deleted: (at plane2 city6) (fuel-level plane2 fl4)
   added: (at plane2 city14) (fuel-level plane2 fl2)
   goals met: 5 of 22
22. (debark person16 plane2 city14)
   deleted: (in person16 plane2)
   added: (at person16 city14)
   goals met: 6 of 22
23. (fly plane6 city13 city5 fl1 fl0)
   deleted: (at plane6 city13) (fuel-level plane6 fl1)
   added: (at plane6 city5) (fuel-level plane6 fl0)
   goals met: 7 of 22
24. (refuel plane6 city5 fl0 fl1)
   deleted: (fuel-level plane6 fl0)
   added: (fuel-level plane6 fl1)
   goals met: 7 of 22
25. (debark person18 plane6 city5)
   deleted: (in person18 plane6)
   added: (at person18 city5)
   goals met: 8 of 22
26. (zoom plane1 city12 city10 fl3 fl2 fl1)
   deleted: (at plane1 city12) (fuel-level plane1 fl3)
   added: (at plane1 city10) (fuel-level plane1 fl1)
   goals met: 8 of 22
27. (board person14 plane1 city10)
   deleted: (at person14 city10)
   added: (in person14 plane1)
   goals met: 8 of 22
28. (fly plane1 city10 city3 fl1 fl0)
   deleted: (at plane1 city10) (fuel-level plane1 fl1)
   added: (at plane1 city3) (fuel-level plane1 fl0)
   goals met: 8 of 22
29. (board person17 plane1 city3)
   deleted: (at person17 city3)
   added: (in person17 plane1)
   goals met: 8 of 22
30. (refuel plane1 city3 fl0 fl1)
   deleted: (fuel-level plane1 fl0)
   added: (fuel-level plane1 fl1)
   goals met: 8 of 22
31. (debark person14 plane1 city3)
   deleted: (in person14 plane1)
   added: (at person14 city3)
   goals met: 9 of 22
32. (fly plane1 city3 city7 fl1 fl0)
   deleted: (at plane1 city3) (fuel-level plane1 fl1)
   added: (at plane1 city7) (fuel-level plane1 fl0)
   goals met: 9 of 22
33. (debark person17 plane1 city7)
   deleted: (in person17 plane1)
   added: (at person17 city7)
   goals met: 10 of 22
34. (zoom plane2 city14 city11 fl2 fl1 fl0)
   deleted: (at plane2 city14) (fuel-level plane2 fl2)
   added: (at plane2 city11) (fuel-level plane2 fl0)
   goals met: 10 of 22
35. (board person12 plane2 city11)
   deleted: (at person12 city11)
   added: (in person12 plane2)
   goals met: 10 of 22
36. (zoom plane5 city16 city17 fl3 fl2 fl1)
   deleted: (at plane5 city16) (fuel-level plane5 fl3)
   added: (at plane5 city17) (fuel-level plane5 fl1)
   goals met: 10 of 22
37. (board person9 plane5 city17)
   deleted: (at person9 city17)
   added: (in person9 plane5)
   goals met: 10 of 22
38. (board person15 plane5 city17)
   deleted: (at person15 city17)
   added: (in person15 plane5)
   goals met: 10 of 22
39. (refuel plane2 city11 fl0 fl1)
   deleted: (fuel-level plane2 fl0)
   added: (fuel-level plane2 fl1)
   goals met: 10 of 22
40. (fly plane2 city11 city14 fl1 fl0)
   deleted: (at plane2 city11) (fuel-level plane2 fl1)
   added: (at plane2 city14) (fuel-level plane2 fl0)
   goals met: 10 of 22
41. (debark person12 plane2 city14)
   deleted: (in person12 plane2)
   added: (at person12 city14)
   goals met: 11 of 22
42. (fly plane5 city17 city4 fl1 fl0)
   deleted: (at plane5 city17) (fuel-level plane5 fl1)
   added: (at plane5 city4) (fuel-level plane5 fl0)
   goals met: 11 of 22
43. (refuel plane5 city4 fl0 fl1)
   deleted: (fuel-level plane5 fl0)
   added: (fuel-level plane5 fl1)
   goals met: 11 of 22
44. (debark person15 plane5 city4)
   deleted: (in person15 plane5)
   added: (at person15 city4)
   goals met: 12 of 22
45. (fly plane5 city4 city8 fl1 fl0)
   deleted: (at plane5 city4) (fuel-level plane5 fl1)
   added: (at plane5 city8) (fuel-level plane5 fl0)
   goals met: 12 of 22
46. (debark person9 plane5 city8)
   deleted: (in person9 plane5)
   added: (at person9 city8)
   goals met: 13 of 22
47. (board person2 plane5 city8)
   deleted: (at person2 city8)
   added: (in person2 plane5)
   goals met: 13 of 22
48. (refuel plane5 city8 fl0 fl1)
   deleted: (fuel-level plane5 fl0)
   added: (fuel-level plane5 fl1)
   goals met: 13 of 22
49. (fly plane5 city8 city20 fl1 fl0)
   deleted: (at plane5 city8) (fuel-level plane5 fl1)
   added: (at plane5 city20) (fuel-level plane5 fl0)
   goals met: 13 of 22
50. (debark person2 plane5 city20)
   deleted: (in person2 plane5)
   added: (at person2 city20)
   goals met: 14 of 22
51. (fly plane3 city0 city11 fl1 fl0)
   deleted: (at plane3 city0) (fuel-level plane3 fl1)
   added: (at plane3 city11) (fuel-level plane3 fl0)
   goals met: 13 of 22
52. (refuel plane3 city11 fl0 fl1)
   deleted: (fuel-level plane3 fl0)
   added: (fuel-level plane3 fl1)
   goals met: 13 of 22
53. (debark person13 plane3 city11)
   deleted: (in person13 plane3)
   added: (at person13 city11)
   goals met: 14 of 22
54. (fly plane3 city11 city0 fl1 fl0)
   deleted: (at plane3 city11) (fuel-level plane3 fl1)
   added: (at plane3 city0) (fuel-level plane3 fl0)
   goals met: 15 of 22
55. (fly plane4 city14 city4 fl1 fl0)
   deleted: (at plane4 city14) (fuel-level plane4 fl1)
   added: (at plane4 city4) (fuel-level plane4 fl0)
   goals met: 14 of 22
56. (refuel plane4 city4 fl0 fl1)
   deleted: (fuel-level plane4 fl0)
   added: (fuel-level plane4 fl1)
   goals met: 14 of 22
57. (debark person5 plane4 city4)
   deleted: (in person5 plane4)
   added: (at person5 city4)
   goals met: 15 of 22
58. (fly plane4 city4 city5 fl1 fl0)
   deleted: (at plane4 city4) (fuel-level plane4 fl1)
   added: (at plane4 city5) (fuel-level plane4 fl0)
   goals met: 15 of 22
59. (refuel plane4 city5 fl0 fl1)
   deleted: (fuel-level plane4 fl0)
   added: (fuel-level plane4 fl1)
   goals met: 15 of 22
60. (debark person10 plane4 city5)
   deleted: (in person10 plane4)
   added: (at person10 city5)
   goals met: 16 of 22
61. (fly plane4 city5 city18 fl1 fl0)
   deleted: (at plane4 city5) (fuel-level plane4 fl1)
   added: (at plane4 city18) (fuel-level plane4 fl0)
   goals met: 16 of 22
62. (refuel plane4 city18 fl0 fl1)
   deleted: (fuel-level plane4 fl0)
   added: (fuel-level plane4 fl1)
   goals met: 16 of 22
63. (board person8 plane4 city18)
   deleted: (at person8 city18)
   added: (in person8 plane4)
   goals met: 16 of 22
64. (board person3 plane4 city18)
   deleted: (at person3 city18)
   added: (in person3 plane4)
   goals met: 16 of 22
65. (fly plane4 city18 city11 fl1 fl0)
   deleted: (at plane4 city18) (fuel-level plane4 fl1)
   added: (at plane4 city11) (fuel-level plane4 fl0)
   goals met: 16 of 22
66. (refuel plane4 city11 fl0 fl1)
   deleted: (fuel-level plane4 fl0)
   added: (fuel-level plane4 fl1)
   goals met: 16 of 22
67. (debark person8 plane4 city11)
   deleted: (in person8 plane4)
   added: (at person8 city11)
   goals met: 17 of 22
68. (fly plane4 city11 city20 fl1 fl0)
   deleted: (at plane4 city11) (fuel-level plane4 fl1)
   added: (at plane4 city20) (fuel-level plane4 fl0)
   goals met: 17 of 22
69. (refuel plane4 city20 fl0 fl1)
   deleted: (fuel-level plane4 fl0)
   added: (fuel-level plane4 fl1)
   goals met: 17 of 22
70. (debark person3 plane4 city20)
   deleted: (in person3 plane4)
   added: (at person3 city20)
   goals met: 18 of 22
71. (fly plane4 city20 city14 fl1 fl0)
   deleted: (at plane4 city20) (fuel-level plane4 fl1)
   added: (at plane4 city14) (fuel-level plane4 fl0)
   goals met: 19 of 22
72. (fly plane6 city5 city14 fl1 fl0)
   deleted: (at plane6 city5) (fuel-level plane6 fl1)
   added: (at plane6 city14) (fuel-level plane6 fl0)
   goals met: 18 of 22
73. (refuel plane6 city14 fl0 fl1)
   deleted: (fuel-level plane6 fl0)
   added: (fuel-level plane6 fl1)
   goals met: 18 of 22
74. (debark person4 plane6 city14)
   deleted: (in person4 plane6)
   added: (at person4 city14)
   goals met: 19 of 22
75. (fly plane6 city14 city16 fl1 fl0)
   deleted: (at plane6 city14) (fuel-level plane6 fl1)
   added: (at plane6 city16) (fuel-level plane6 fl0)
   goals met: 19 of 22
76. (refuel plane6 city16 fl0 fl1)
   deleted: (fuel-level plane6 fl0)
   added: (fuel-level plane6 fl1)
   goals met: 19 of 22
77. (debark person6 plane6 city16)
   deleted: (in person6 plane6)
   added: (at person6 city16)
   goals met: 20 of 22
78. (fly plane6 city16 city7 fl1 fl0)
   deleted: (at plane6 city16) (fuel-level plane6 fl1)
   added: (at plane6 city7) (fuel-level plane6 fl0)
   goals met: 20 of 22
79. (refuel plane6 city7 fl0 fl1)
   deleted: (fuel-level plane6 fl0)
   added: (fuel-level plane6 fl1)
   goals met: 20 of 22
80. (debark person7 plane6 city7)
   deleted: (in person7 plane6)
   added: (at person7 city7)
   goals met: 21 of 22
81. (fly plane6 city7 city5 fl1 fl0)
   deleted: (at plane6 city7) (fuel-level plane6 fl1)
   added: (at plane6 city5) (fuel-level plane6 fl0)
   goals met: 22 of 22
